<?php
return [
    'create' => 'تم إنشاء الصندوق الكهربائي بنجاح',
    'update' => 'تم تحديث الصندوق الكهربائي بنجاح',
    'delete' => 'تم حذف الصندوق الكهربائي بنجاح',
    'bulk_delete' => 'تم حذف الصناديق الكهربائية بنجاح',
    'show' => 'تم جلب تفاصيل الصندوق الكهربائي بنجاح',
    'generator_areas_retrieved' => 'تم جلب مناطق المولد بنجاح',
    'total_boxes' => 'تم جلب عدد الصناديق الكلي بنجاح',
    'boxes_retrieved' => 'تم جلب الصناديق بنجاح',
    'assign' => 'تم تعيين الصندوق بنجاح',
    'unAssigned' => 'تم إلغاء تعيين الصندوق بنجاح',
];
