<?php
return [
    'create' => 'تم إنشاء العداد بنجاح',
    'update' => 'تم تحديث العداد بنجاح',
    'delete' => 'تم حذف العداد بنجاح',
    'assign' => 'تم تعيين العداد للصندوق بنجاح',
    'remove' => 'تم إزالة العداد من الصندوق بنجاح',
    'box_counters_retrieved' => 'تم جلب عدادات الصندوق بنجاح',
    'not_assigned' => 'العداد غير معين حاليًا لأي صندوق',
    'current_box_retrieved' => 'تم جلب الصندوق الحالي بنجاح',
    'no_counters_to_delete' => 'لم يتم اختيار أي عدادات للحذف',
    'for_generator' => 'تم جلب عدادات المولد بنجاح',
];
