<?php
return [
    'success'=>'تم إنهاء طلبك بنجاح.',
    "error" => [
        "server_error" => "عذرًا! يبدو أن خادمنا واجه خطأ غير متوقع. نأسف للإزعاج الذي قد يسببه هذا لك. تم إبلاغ فريقنا ويعمل بجد لإصلاحه. في الوقت الحالي ، يمكنك محاولة تحديث الصفحة أو العودة لاحقًا. شكرًا لصبرك وتفهمك",
        "activation_code_not_found" => "⚠️ فشل التنشيط! ⚠️
رمز التنشيط الذي قدمته غير موجود. يرجى التحقق مرة أخرى من الرمز والمحاولة مرة أخرى. إذا واجهت مشاكل مستمرة ، يرجى الاتصال بالدعم للمساعدة.",
        "activation_code_already_used" => "⚠️ فشل التنشيط! ⚠️
تم استخدام رمز التنشيط الذي استخدمته بالفعل . يمكن استخدام كل رمز مرة واحدة فقط. إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة ، يرجى عدم التردد في الاتصال بنا.",
        "activation_code_expired" => "⚠️ فشل التنشيط! ⚠️
رمز التنشيط الذي قدمته قد انتهت صلاحيته. يرجى الحصول على رمز تنشيط جديد والمحاولة مرة أخرى. إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة إضافية ، يرجى الاتصال بالدعم.",
        "admin_permission" => "عذرًا ، ليس لديك الصلاحيات الكافية للوصول إلى المورد المطلوب",
        "blocked_account" => "هذا الحساب محظور , تواصل مع الإدارة ",
    ],
    "successful_request"=>"تم إنهاء طلبك بنجاح",

    "auth_controller" => [
        "error" => [
            "credentials_error" => "إن الرمز السري الذي أدخلته خاطئ",
        ],
        "device_id_unique" => "لقد قمت مسبقاً بانشاء حسابك من هذا الهاتف , اذا كنت قد نسيته تواصل مع المدير ليساعدك في استرجاعه",
        'register' => " تم التسجيل في التطبيق بنجاح",
        "login" => "مرحبًا :user_name ! تم تسجيل الدخول بنجاح",
        "logout" => " تم تسجيل الخروج بنجاح",
        "email_not_found" => "عنوان البريد الإلكتروني غير موجود",
        "user_not_found"=>"المستخدم غير موجود",
        "device_not_found"=>"الجهاز غير موجود",
        "create_account" => "تم إنشاء الحساب بنجاح ، يرجى التحقق من البريد الإلكتروني الخاص بك",
        "already_verified" => "تم التحقق من هذا البريد الإلكتروني بالفعل",
        "code_incorrect" => "الكود غير صحيح تحققه وحاول مرة أخرى",
        "verified_successfully" => "تم التحقق من بريدك الإلكتروني بنجاح ، مرحبًا بك!",
        "forget_password_verified" => "لقد تحققنا من عملية إعادة تعيين كلمة المرور الخاصة بك بنجاح",
        "resend_code" => "أعدنا إرسال رمز التحقق إلى بريدك الإلكتروني",
        "login_credentials_error" => "البريد الإلكتروني أو كلمة المرور خاطئة",
        "login_successfully" => "تسجيل الدخول بنجاح ، مرحبًا بك مرة أخرى السيد: user_name ، أتمنى لك يومًا سعيدًا!",
        "account_not_verified" => "هذا الحساب غير مُتحقق حتى الآن ، قم بتأكيد حسابك وحاول مرة أخرى",
        "reset_password" => "لقد أرسلنا رمز التحقق إلى بريدك الإلكتروني",
        "password_changed" => "تم تغيير كلمة مرورك بنجاح",
        "logout_successfully" => "تم تسجيل خروجك بنجاح",
        "wrong_current_password" => "لقد قدمت لنا كلمة مرور حالية خاطئة تحقق منها وحاول مرة أخرى",
        "create_admin_account" => "تم إنشاء حساب مسؤول جديد بنجاح",

    ],
    "app_info_controller" => [
        "create_privacy_policy" => "🎉 تم تعديل سياسة الخصوصية!",
        "delete_privacy_policy" => "🗑️ تم حذف سياسة الخصوصية! ",
        "privacy_policy_not_found"=>"لا يوجد سياسة خصوصية",
        "create_terms_and_conditions" => "🎉 تم تعديل الشروط و الأحكام!",
        "delete_terms_and_conditions" => "🗑️ تم حذف الشروط و الأحكام! ",
        "terms_and_conditions_not_found"=>"لا يوجد شروط و أحكام ",
        "create_about_app" => "🎉 تم تعديل معلومات التطبيق!",
        "delete_about_app" => "🗑️ تم حذف معلومات التطبيق! ",
        "about_app_not_found"=>"لا يوجد معلومات التطبيق ",


    ],
    "category_controller" => [
        "create_category" => "🎉 تم إنشاء فئة جديدة!",
        "update_category" => "🔄 تم تحديث الفئة! ",
        "delete_category" => "🗑️ تم حذف الفئة! "
    ],
    "category_request_controller" => [
        "create_category" => "🎉 تم إنشاء طلب فئة جديدة!",
        "update_category" => "🔄 تم تعديل طلب الفئة! ",
        "delete_category" => "🗑️ تم حذف طلب الفئة! ",
        "accept_category"=>"تم قبول طلب الفئة",
        "reject_category"=>"تم رفض طلب الفئة",
    ],
    "verification_controller" => [
        "create_verification" => "🎉 تم إنشاء طلب توثيق لمتجرك!",
        "update_verification" => "🔄 تم تعديل طلب التوثيق! ",
        "delete_verification" => "🗑️ تم حذف طلب التوثيق! ",
        "accept_verification"=>"تم قبول طلب التوثيق",
        "reject_verification"=>"تم رفض طلب التوثيق",
    ],
    "offer_controller" => [
        "create_offer_request" => "🎉 تم إنشاء طلب نوع عرض جديد!",
        "update_offer_request" => "🔄 تم تعديل طلب نوع العرض ! ",
        "delete_offer_request" => "🗑️ تم حذف طلب نوع العرض! ",
        "accept_offer_request"=>"تم قبول طلب نوع العرض ",
        "reject_offer_request"=>"تم رفض طلب نوع العرض ",
        "create_comment" => "🎉 تم إنشاء تعليق جديد!",
        "update_comment" => "🔄 تم تعديل التعليق! ",
        "delete_comment" => "🗑️ تم حذف التعليق! ",
        "not_your_comment"=>"لا يمكنك تعديل أو حذف هذا التعليق, هذا ليس تعليقك",
        "create_offer" => "🎉 تم إنشاء عرض جديد!",
        "update_offer" => "🔄 تم تعديل العرض! ",
        "delete_offer" => "🗑️ تم حذف العرض! ",
        "archive_offer" => "تمت أرشفة العرض",
        "activate_offer" => "تم تنشيط العرض مرة أخرى ",
        "not_found"=>"العرض غير موجود",
    ],
    "product_controller" => [
        "create_product" => "🎉 تم إنشاء منتج جديد!",
        "create_colors" => "🎉 تم إنشاء ألوان المنتج!",
        "create_sizes" => "🎉 تم إنشاء احجام المنتج!",
        "delete_product" => "🗑️ تم حذف المنتج! ",
        "not_found"=>"المنتج غير موجود",
    ],
    "rate_controller" => [
        "create_rate" => "🎉 تم تقييم المتجر!",

    ],

    "chapter_controller" => [
        "create" => "📚 تمت إضافة فصل جديد! 🌟 لنوسع عالم قصتنا!",
        "update" => "🔄 تم تحديث الفصل! 🔍 نحسن رحلتنا السردية!",
        "delete" => "🗑️ تم حذف الفصل! 🚫 نحافظ على قصتنا مُركَّزة ومرتبة!",
        "visibility_switch" => "👁️‍🗨️ تم تبديل رؤية الفصل! 🌈 نسلط الضوء على تطورات قصتنا الأخيرة! "
    ],

    "choice_controller" => [
        "create" => "🎲 تمت إضافة خيار جديد! 🌟 نوسع خياراتنا للاستكشاف!",
        "update" => "🔄 تم تحديث الخيار! 🔍 نقوم بضبط رحلتنا في اتخاذ القرارات!",
        "delete" => "🗑️ تم حذف الخيار! 🚫 نحافظ على خياراتنا موجزة وملائمة!",
        "visibility_switch" => "👁️‍🗨️ تم تبديل رؤية الخيار! 🌈 نضيء الضوء على المسارات المختارة!",
        "make_choice_true" => "✅ تم تأكيد الخيار! 🎉 نتبنى المسار المختار بثقة!"
    ],

    "course_controller" => [
        "error" => [
            "invisible_course" => "🔍 تحديث رؤية الدورة! 📚 الدورة التي تحاول الوصول إليها غير مرئية حاليًا. إذا كنت تعتقد أن هذا خطأ أو لديك أي أسئلة ، يرجى التواصل مع المسؤول للحصول على مساعدة إضافية.",
            "user_already_enrolled" => "⚠️ فشل التسجيل! ⚠️
أنت بالفعل مسجل في الدورة :course_name لا يُسمح بالتسجيل المتكرر. إذا كانت لديك أي أسئلة أو استفسارات ، يرجى الاتصال بالدعم للحصول على المساعدة.",
            "already_enrolled" => "🛑 تم اكتشاف تكرار التسجيل! 📚 المستخدم :username مسجل بالفعل في :course_name. يرجى مراجعة سجلات التسجيل لتجنب التكرارات.",
            "one_category_at_least" => "⚠️ خطأ: فشل إنشاء الدورة! ⚠️ للمتابعة ، يرجى تقديم فئة واحدة على الأقل للدورة الجديدة. الفئات ضرورية لتنظيم محتوى التعليم لدينا. يرجى المحاولة مرة أخرى مع المعلومات الضرورية. شكرا لك! ",
            "one_teacher_at_least" => "⚠️ خطأ: فشل إنشاء الدورة! ⚠️ للمتابعة ، يرجى تعيين مدرس واحد على الأقل للدورة الجديدة. المدرسون ضروريون لتوجيه رحلات تعلم طلابنا. يرجى المحاولة مرة أخرى مع المعلومات الضرورية. شكرا لك! ",
            "wrong_match_course_with_code" => "⚠️ فشل التنشيط! ⚠️
الرمز التنشيط الذي قدمته لا يمكن استخدامه لتنشيط الدورة المطلوبة. يرجى التأكد من أنك قد أدخلت الرمز الصحيح أو الاتصال بالدعم للمساعدة. شكرا لتفهمك.",
        ],
        "create" => "📚 تم إنشاء دورة جديدة! 🚀 تم إنشاء الدورة :course_name بنجاح. حان الوقت لتشكيل العقول وتحفيز التعلم!",
        "update" => "🔄 تم تحديث الدورة! 📚 تم تحديث الدورة :course_name بنجاح بأحدث المعلومات. لنستمر في إثراء العقول وتمكين المتعلمين!",
        "delete" => "🧹 تم مسح الدورة! 📝 نحن نفسح المجال لجهود تعليمية جديدة. ",
        "cancel_enrolment" => "🚫 تم إلغاء التسجيل بنجاح",
        "visibility_switch" => "👁️‍🗨️ تم تبديل رؤية الدورة! 🌟 تم تحديث الرؤية. لنواصل تشكيل منظرنا التعليمي!",
        "free_switch" => "💰 تم تحديث حالة الحرية! 💸 الدورة الآن :status. نحن ملتزمون بتوفير التعليم المتاح.",
        "manual_enrolled_successfully" => "✅ تم اكتمال عملية التسجيل بنجاح! 📚 تم تسجيل :username بنجاح في :course_name. تم تحديث قائمة الدورات.",
        "enroll_successfully" => "✅ تم التسجيل بنجاح! 📚
تهانينا! لقد تم تسجيلك بنجاح في الدورة :course_name. استعد للانطلاق في رحلة التعلم والاكتشاف. إذا كان لديك أي أسئلة أو تحتاج إلى مساعدة ، فلا تتردد في التواصل. تعلم سعيد!"
    ],

    "course_value_controller" => [
        "create" => "🌟 تمت إضافة قيمة جديدة! 💡 نحتضن مبدأً جديدًا في رحلتنا التعليمية: :value_name . دعونا نزرع ثقافة :value_name.",
        "update" => "🔄 تم تحديث القيمة! 🔧 نتطور في فهمنا لـ :value_name . لنواصل تحسين التزامنا بـ :value_name .",
        "delete" => "🗑️ تم حذف القيمة! 🚫 وداعًا لـ :value_name. ومع وداعنا ، نفسح المجال لرؤى ونمو جديدين.",
    ],

    "exportable_file_controller" => [
        "delete" => "🗑️ تم حذف الملف! 🚫 تمت إزالة الملف :file_name بنجاح من الخادم. نحافظ على تنظيم تخزيننا ونظافته.",
    ],

    "lesion_controller" => [
        'visibility_switch' => "👁️‍🗨️ تم تبديل رؤية الدرس! 🌟 تم تحديث الرؤية. لنواصل توجيه متعلمينا بوضوح وهدف!",
        "delete" => "🗑️ تم حذف الدرس! 🚫 تمت إزالة درس بنجاح من الدورة. نحافظ على منهجنا موجزًا ومركزًا.",
        "create" => "📝 تم إنشاء درس جديد! 🚀 تمت إضافة درس جديد إلى الدورة. دعونا نستكشف مواضيع جديدة مثيرة ونوسع معرفتنا!",
        "update" => "🔄 تم تحديث الدرس! 📝 تم تحديث الدرس بنجاح بأحدث التغييرات. لنتأكد من أن محتوانا مليء بالحيوية والمعرفة!",
    ],

    "news_controller" => [
        "create" => "📰 تمت إضافة خبر جديد إلى شريط الأخبار! 🌟 ابق مُحدثًا بآخر التطورات.",
        "update" => "🔄 تم تحديث عنصر الخبر في شريط الأخبار! 📝 نبقي جمهورنا مطلعين بمحتوى جديد.",
        "delete" => "🗑️ تمت إزالة عنصر الخبر من شريط الأخبار! 🚫 نحن نفسح المجال للتحديثات الجديدة.",
        "visibility_switch" => "👁️‍🗨️ تم تبديل رؤية عنصر الخبر في شريط الأخبار! 🌈 نضيء الضوء على أمور هامة."
    ],

    "notification_controller" => [
        "send_successfully" => "✉️ تم إرسال الإشعار بنجاح! 🚀 تم تسليم رسالتك بنجاح إلى المستلمين المقصودين. لنواصل التواصل!",
    ],

    "question_controller" => [
        "create" => "📝 تم إنشاء سؤال جديد! 🌟 دعونا نوسع قاعدة معرفتنا باستفسارات فطنة.",
        "update" => "🔄 تم تحديث السؤال! 🔍 نحافظ على سؤالاتنا ذات الصلة والمثيرة.",
        "delete" => "🗑️ تم حذف السؤال! 🚫 نحن نفسح المجال للاستفسارات الجديدة.",
    ],

    "quiz_controller" => [
        "error" => [
            "quiz_added_before_to_chapter" => "⚠️ الاختبار مضاف بالفعل إلى الفصل! ⚠️ الاختبار الذي تحاول إضافته موجود بالفعل في هذا الفصل. يرجى ضمان تماثل المحتوى وتجنب التكرار. إذا كان لديك أي أسئلة ، فلا تتردد في التواصل.",
        ],
        "create" => "📝 تم إنشاء اختبار جديد! 🌟 دعونا نبدأ المرح والتعلم مع هذا الاختبار المثير. استعد لتحدي وجذب جمهورك!",
        "update_quiz_in_chapter" => "🔄 تم تحديث الاختبار في الفصل! 📝 تم تحديث محتوى الاختبار لتعزيز تجارب التعلم داخل الفصل. لنحافظ على جذب وتحفيز متعلمينا!",
        "update" => "🔄 تم تحديث الاختبار! 📝 تم تحديث الاختبار بأسئلة جديدة وتحسينات. استعد لتجربة تعلم محسنة!",
        "delete" => "🗑️ تم حذف الاختبار! 🚫 تمت إزالة الاختبار. نحن نفسح المجال لتحديات وفرص تعلم جديدة.",
        "delete_from_chapter" => "🗑️ تم حذف الاختبار من الفصل! 🚫 تمت إزالة الاختبار من هذا الفصل. ضبط المحتوى لتناسب أهداف التعلم لدينا.",
        "questions_added" => "✅ تمت إضافة الأسئلة بنجاح إلى الاختبار! 🌟 تم دمج الأسئلة المحددة بنجاح في الاختبار المطلوب. الاختبار مثر بالآن بمحتوى جديد.",
        "delete_question_from_quiz" => "🗑️ تم حذف السؤال من الاختبار! 🚫 تمت إزالة السؤال من الاختبار. ضمان تناغم محتوى الاختبار تمامًا مع أهداف التعلم لدينا.",
        "visibility_update" => "👁️‍🗨️ تم تحديث رؤية الأسئلة في الاختبار! 🌟 تم تعديل رؤية الأسئلة داخل الاختبار. لنضمن تجربة تعلم سلسة لمشاركينا!",
        "quiz_to_chapter_successfully" => "✅ تمت إضافة الاختبار بنجاح إلى الفصل! 📝 تم دمج الاختبار بنجاح في الفصل. الآن هو جاهز لجذب وتحدي متعلمينا.",
    ],

    "statistics_controller" => [
        "reset_successfully" => "✅ تمت إعادة ضبط الإحصائيات بنجاح! 📊 تمت إعادة تعيين جميع البيانات ، مما يضمن بداية جديدة لتتبع التقدم والأداء. ",
    ],

    "user_controller" => [
        "create" => "✅ تم إنشاء الحساب بنجاح! 🎉 تم إنشاء الحساب الجديد بنجاح.",
        "update_profile" => "✅ تم تحديث الملف الشخصي بنجاح! 🔄 تم تحديث معلومات ملفك الشخصي بنجاح. شكرًا لك على الحفاظ على تفاصيلك حديثة! ",
        "block_switch" => "✅ تم تحديث حالة حظر الحساب بنجاح! 🚫 تم تبديل حالة الحظر للحساب بنجاح. ",
        "delete_user" => "✅ تمت إزالة الحساب والبيانات ذات الصلة بنجاح! 🗑️ تم حذف الحساب بالإضافة إلى جميع البيانات المرتبطة به. الانتهاء من التنظيف! ",
        "reset_password" => "✅ لقد قمنا بإعادة تعين كلمة المرور الخاصة بهذا الحساب , تأكد من ابقاء كلمة المرور الخاصة بك في مكان امن"
    ],

    "user_watch_controller" => [
        "watch_registered" => "👀 تم تسجيل مشاهدة الفيديو بنجاح! 📹 تم تسجيل مشاهدتك للفيديو بنجاح من قبل النظام. استمر في استكشاف محتوانا! ",
    ],

    "video_controller" => [
        "link_not_correct" => "⚠️ خطأ: الرابط غير صحيح! ⚠️ الرابط الذي قدمته غير صحيح أو مكسور. يرجى التحقق مرة أخرى من عنوان URL والمحاولة مرة أخرى. إذا واجهت مشكلة مستمرة ، يرجى الاتصال بالدعم للحصول على المساعدة. شكرًا لك! ",
    ],



    "AdvertisementController" => [
        "Advertisement_Added_Successfully" => "تم إضافةالإعلان بنجاح",
        "All_Advertisement_Requests" => "عرض جميع طلبات الإعلانات",
        "Advertisement_Details" => "تفاصيل الإعلان",
        "Advertisement_Accepted" => "تم قبول الإعلان بتجاح",
        "Advertisement_Rejected" => "تم رفض الإعلان",
        "List_Advertisements" => "عرض جميع الإعلانات",
    ],

"BranchController" => [
        "Branch_Added_Successfully" => "تم إضافة فرع جديد بنجاح",
        "Branch_Updated_Successfully" => "تم تعديل بيانات الفرع بنجاح",
        "Branch_Deleted_Successfully" => "تم حذف الفرع بنجاح",
        "List_Branches" => "عرض جميع الفروع",
        "You_Are_Not_Authorized" => "ليس لديك الصلاحية للقيام بذلك",
        "Branch_Info" => "احصائيات الفرع",
        "List_Recent_Products" => "عرض أحدث المنتجات",
        "List_Yearly_Rates" => "عرض التقييمات الشهرية خلال العام الحالي",
    ],

    "CategoryController" => [
        "List_All_Categories" => "عرض جميع الأقسام",
        "Category_Added_Successfully" => "تم إضافة قسم جديد بنجاح",
        "Category_Updated_Successfully" => "تم تعديل القسم بنجاح",
        "Category_Deleted_Successfully" => "تم حذف القسم بنجاح",
        "Show_Category" => "عرض القسم",
    ],

    "ComplaintController" => [
        "List_All_Complaints" => "عرض جميع الشكاوى",
        "Show_Complaint_Details" => "عرض تفاصيل الشكوى",
        "Complaint_Added_Successfully" => "تم إرسال الشكوى بنجاح",
    ],

    "EmployeeController" => [
        "Employee_Added_Successfully" => "تم إضافة موظف جديد بنجاح",
        "Employee_Updated_Successfully" => "تم تعديل بيانات الموظف بنجاح",
        "Code_Updated_Successfully" => "تم تعديل الكود بنجاح",
        "Employee_Deleted_Successfully" => "تم حذف الموظف بنجاح",
        "List_Employees" => "عرض الموظفين",
        "Store_Not_Found" => "المتجر غير موجود",
        "You_Are_Not_Authorized" => "ليس لديك الصلاحية للقيام بذلك",
    ],

    "FaqController" => [
        "List_All_Faq" => "عرض جميع الأسئلة والأجوبة الشائعة",
        "Faq_Added_Successfully" => "تم إضافة سؤال وجواب بنجاح",
        "Faq_Updated_Successfully" => "تم تعديل السؤال والجواب بنجاح",
        "Faq_Deleted_Successfully" => "تم حذف السؤال والجواب",
        "Show_Faq_Details" => "عرض تفاصيل السؤال والجواب",
    ],

    "FavoriteController" => [
        "List_All_Favorites" => "عرض المفضلة",
        "Branch_Already_In_Your_Favorites" => "الفرع موجود بالفعل في المفضلة",
        "Branch_Added_To_Your_Favorites" => "تم إضافة الفرع إلى المفضلة الخاصة بك",
    ],

    "NotifiedController" => [
        "List_My_Notifieds" => "عرض جميع الاشعارات",
        "Notified_Added_Successfully" => "تم إرسال اشعار بنجاح",
        "Notified_Deleted_Successfully" => "تم حذف الاشعار بنجاح",
    ],

    "ProfileController" => [
        "My_Profile" => "بيانات حسابي",
        "Profile_Updated_Successfully" => "تم تعديل بيانات الحساب بنجاح",
        "User_Not_Found" => "المستخدم غير موجود",
        "Account_Deleted_Successfully" => "تم حذف الحساب بنجاح",
        "Account_Restored_Successfully" => "تم إستعادة الحساب بنجاح",
        "Account_Deleted_For_Ever" => "تم حذف الحساب بشكل نهائي، ولا يمكن استرجاعه مرة أخرى",
        "Password_Is_Wrong" => "كلمة المرور خاطئة",
        "Account_Blocked" => "تم حظر الحساب بنجاح",
        "Account_Active_Now" => "الحساب نشط الآن",
        "List_All_Customers" => "عرض جميع العملاء",
        "List_All_Merchants" => "عرض جميع التجار",
        "Merchant_Details" => "تفاصيل بيانات التاجر",
        "List_All_Employees" => "عرض جميع الموظفين",
        "List_All_Admins" => "عرض جميع المديرين",
    ],

    "StoreController" => [
        "Store_Added_Successfully" => "تم إضافة متجر جديد بنجاح",
        "Not_Authurized" => "ليس لديك الصلاحية للقيام بذلك",
        "Store_Updated_Successfully" => "تم تعديل بيانات المتجر بنجاح",
        "Store_Deleted_Successfully" => "تم حذف المتجر بنجاح",
        "List_visible_Stores" => "عرض المتاجر",
        "List_Merchant_Stores" => "عرض المتاجر الخاصة بالتاجر",
        "List_All_Stores" => "عرض جميع المتاجر",
        "list_stores" => "عرض المتاجر",
        "Store_Details" => "تفاصيل المتجر",
    ],

];
