<?php
return [
    'cash' => 'تمت عملية الدفع بنجاح، استمتع بخدمتنا وشكرًا لثقتك بنا!',
    'success' => 'تمت عملية الدفع بنجاح، استمتع بخدمتنا وشكرًا لثقتك بنا!',
    'cancel' => 'تم إلغاء عملية الدفع.',
    'create' => 'تم إنشاء عملية الدفع بنجاح، يرجى المتابعة على Stripe.',
    'notFound' => 'لم يتم العثور على عملية الدفع.',
    'payOnDueDate' => 'يمكنك الدفع فقط في تاريخ الاستحقاق أو قبل يوم واحد منه.',
    'payWithCache' => 'تم فصل العداد الخاص بك، يرجى التواصل مع مالك المولد لإجراء الدفع وإعادة التوصيل.',
];
